---
kind: property
id: P:Autodesk.Revit.DB.PaperSourceSet.IsEmpty
source: html/2a9e4d99-edc0-6afb-b08c-ef5d65a16b31.htm
---
# Autodesk.Revit.DB.PaperSourceSet.IsEmpty Property

Test to see if the set is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the set is empty then True will be returned, otherwise False.